
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
  * module.case-disposer-action-group.azurerm_resource_group_template_deployment.action-group
* Update
  * module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.case-disposer-action-group.azurerm_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.caseDisposerAlertEmail will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "caseDisposerAlertEmail" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
      + name                    = "caseDisposerAlertEmail"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.case-disposer-action-group.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "dispr-alert"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive value)
      + resource_group_name = "ccd-shared-aat"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.case-disposer-action-group.azurerm_template_deployment.action-group will be destroyed
  # (because azurerm_template_deployment.action-group is not in configuration)
  - resource "azurerm_template_deployment" "action-group" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Resources/deployments/dispr-alert_aat" -> null
      - name                = "dispr-alert_aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"      = "ccd-case-disposer-aat-ag"
          - "emailReceiverAddress" = (sensitive value)
          - "emailReceiverName"    = "Case Disposer Deletion Failure Alert"
          - "location"             = "global"
          - "shortName"            = "dispr-alert"
        } -> null
      - resource_group_name = "ccd-shared-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName      = {
                      - type = "string"
                    }
                  - emailReceiverAddress = {
                      - metadata = {
                          - description = "Email address of the receiver"
                        }
                      - type     = "string"
                    }
                  - emailReceiverName    = {
                      - metadata = {
                          - description = "Name of the email receiver"
                        }
                      - type     = "string"
                    }
                  - location             = {
                      - defaultValue = "global"
                      - type         = "string"
                    }
                  - shortName            = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-04-01"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('actionGroupName')]"
                      - properties = {
                          - emailReceivers   = [
                              - {
                                  - emailAddress = "[parameters('emailReceiverAddress')]"
                                  - name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          - enabled          = true
                          - groupShortName   = "[parameters('shortName')]"
                          - smsReceivers     = []
                          - webhookReceivers = []
                        }
                      - tags       = {}
                      - type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        ) -> null
    }

  # module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat|lau-aat"
        name                       = "lau-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":29,"Program":"tfcmt","SHA1":"","Vars":{}} -->